In [1]:
# examples in chapter 2.5 of the Chinese version of book "Joyful Pandas" (pandas数据处理与分析)

In [2]:
import numpy as np
import pandas as pd

In [3]:
import os
os.chdir("../../")

In [35]:
# 1.整理某服装店的商品情况

In [9]:
df = pd.read_csv("./data/ch2/clothing_store.csv")
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   type_1      10000 non-null  object
 1   type_2      10000 non-null  object
 2   buy_price   10000 non-null  int64
 3   sale_price  10000 non-null  int64
 4   product_id  10000 non-null  object
dtypes: int64(2), object(3)
memory usage: 390.8+ KB

In [26]:
df.head()

  type_1 type_2  buy_price  sale_price product_id
0     裤子    游泳裤        145         154    S007721
1     鞋子     凉鞋         98         101    S007156
2     鞋子     拖鞋        122         149    S002286
3     鞋子     拖鞋         55          74    S009119
4     鞋子     凉鞋         79         112    S004373

In [27]:
df["margin"] = df.sale_price - df.buy_price
df.margin.mean()

24.3481

In [28]:
df.head()

  type_1 type_2  buy_price  sale_price product_id  margin
0     裤子    游泳裤        145         154    S007721       9
1     鞋子     凉鞋         98         101    S007156       3
2     鞋子     拖鞋        122         149    S002286      27
3     鞋子     拖鞋         55          74    S009119      19
4     鞋子     凉鞋         79         112    S004373      33

In [18]:
s = pd.Series(
    data=[f"type_1 is {r[0]}, type_2 is {r[1]}, buy_price and sale price is {r[2]} and {r[3]} respectively" for r in df.values[:]],
    index=pd.Index(df.product_id),
    dtype="string",
    name="description"
)
s

product_id
S007721    type_1 is 裤子, type_2 is 游泳裤, buy_price and sal...
S007156    type_1 is 鞋子, type_2 is 凉鞋, buy_price and sale...
S002286    type_1 is 鞋子, type_2 is 拖鞋, buy_price and sale...
S009119    type_1 is 鞋子, type_2 is 拖鞋, buy_price and sale...
S004373    type_1 is 鞋子, type_2 is 凉鞋, buy_price and sale...
                                 ...
S004636    type_1 is 鞋子, type_2 is 拖鞋, buy_price and sale...
S001560    type_1 is 鞋子, type_2 is 拖鞋, buy_price and sale...
S001280    type_1 is 上衣, type_2 is T恤, buy_price and sale...
S001207    type_1 is 裤子, type_2 is 长裤, buy_price and sale...
S002475    type_1 is 裤子, type_2 is 中裤, buy_price and sale...
Name: description, Length: 10000, dtype: string

In [37]:
t1 = df.type_1.unique()
t1

array(['裤子', '鞋子', '上衣'], dtype=object)

In [36]:
t2 = df.type_2.unique()
t2

array(['游泳裤', '凉鞋', '拖鞋', '跑鞋', '冲锋衣', 'T恤', '长裤', '羽绒服', '中裤'],
      dtype=object)

In [38]:
m = {
    t1[2]: [t2[4], t2[5], t2[7]],
    t1[0]: [t2[0], t2[6], t2[8]],
    t1[1]: [t2[1], t2[2], t2[3]],
}
m

{'上衣': ['冲锋衣', 'T恤', '羽绒服'],
 '裤子': ['游泳裤', '长裤', '中裤'],
 '鞋子': ['凉鞋', '拖鞋', '跑鞋']}

In [74]:
c = {f"{t1}_{t2}" for t1, t2_list in m.items() for t2 in t2_list}
c

{'上衣_T恤',
 '上衣_冲锋衣',
 '上衣_羽绒服',
 '裤子_中裤',
 '裤子_游泳裤',
 '裤子_长裤',
 '鞋子_凉鞋',
 '鞋子_拖鞋',
 '鞋子_跑鞋'}

In [71]:
d = df[["type_1", "type_2"]].drop_duplicates(keep="first")
d.shape

(10, 2)

In [78]:
v = d[["type_1", "type_2"]].values
for i, v in enumerate(d[["type_1", "type_2"]].values):
    ct = f"{v[0]}_{v[1]}"
#     print(ct)
    if ct not in c:
        print(ct)

裤子_拖鞋

In [82]:
dd = df.where(df.type_1=="裤子").dropna()
dd = dd.where(dd.type_2=="拖鞋").dropna()
dd

     type_1 type_2  buy_price  sale_price product_id  margin
6023     裤子     拖鞋      155.0       177.0    S008754    22.0

In [33]:
for type_2 in df.type_2.unique():
    id = df.where(df.type_2==type_2).sort_values("margin", ascending=False).values[0, 4]
    print(f"{type_2}: {id}")

游泳裤: S006542
凉鞋: S007182
拖鞋: S000155
跑鞋: S005563
冲锋衣: S003225
T恤: S004054
长裤: S005169
羽绒服: S008451
中裤: S000617

In [34]:
# 2. 汇总某课程的学生总评分

In [83]:
df = pd.read_csv("./data/ch2/student_grade.csv")

In [87]:
df.head()

,Student_ID,Mid_Term_Grade,Final_Grade,Question_Answering_Times,Absence_Times
0,S001,84.0,69.0,0,0
1,S002,81.0,83.0,4,0
2,S003,83.0,64.0,1,10
3,S004,66.0,89.0,4,0
4,S005,95.0,45.0,4,0

In [84]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 5 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Student_ID                200 non-null    object
 1   Mid_Term_Grade            200 non-null    float64
 2   Final_Grade               200 non-null    float64
 3   Question_Answering_Times  200 non-null    int64
 4   Absence_Times             200 non-null    int64
dtypes: float64(2), int64(2), object(1)
memory usage: 7.9+ KB

In [91]:
min_abs = df.Absence_Times.min()
d = df.where(df.Absence_Times==min_abs)
question_max = d.Question_Answering_Times.max()
d.where(d.Question_Answering_Times==question_max).dropna().Student_ID

33    S034
Name: Student_ID, dtype: object

In [99]:
s = 0.4 * df["Mid_Term_Grade"] + 0.6 * df["Final_Grade"]
s += np.minimum(df["Question_Answering_Times"], 10)
s -= 5* df["Absence_Times"]
s = s.mask(df.Absence_Times > 5, 0)
s = s.clip(0, 100)
df["total_score"] = s
df.query("Absence_Times>5")

,Student_ID,Mid_Term_Grade,Final_Grade,Question_Answering_Times,Absence_Times,total_score
2,S003,83.0,64.0,1,10,0.0
13,S014,85.0,66.0,3,6,0.0
32,S033,75.0,74.0,1,15,0.0
42,S043,72.0,74.0,0,6,0.0
92,S093,88.0,76.0,1,6,0.0
125,S126,77.0,68.0,1,6,0.0
153,S154,80.0,69.0,1,6,0.0

In [105]:
g = df["total_score"]
g = g.mask(df.total_score<60, "F")
g = g.mask((df.total_score>=60) & (df.total_score<80), "P")
g = g.mask((df.total_score>=80) & (df.total_score<90), "G")
g = g.mask(df.total_score>=90, "E")
df["grade"] = g
df.head()

,Student_ID,Mid_Term_Grade,Final_Grade,Question_Answering_Times,Absence_Times,total_score,grade
0,S001,84.0,69.0,0,0,75.0,P
1,S002,81.0,83.0,4,0,86.2,G
2,S003,83.0,64.0,1,10,0.0,F
3,S004,66.0,89.0,4,0,83.8,G
4,S005,95.0,45.0,4,0,69.0,P

In [106]:
for g in df.grade.unique():
    num_student = df.where(df.grade==g).dropna().shape[0]
    print(f"ratio for grade {g} is {num_student / df.shape[0]}")

ratio for grade P is 0.5
ratio for grade G is 0.32
ratio for grade F is 0.08
ratio for grade E is 0.1

In [107]:
# 3. 指数加权窗口

In [109]:
np.random.seed(0)
s = pd.Series(np.random.randint(-1, 2, 30).cumsum())
s.head()

0   -1
1   -1
2   -2
3   -2
4   -2
dtype: int64

In [127]:
s.ewm(alpha=0.2).mean().head(10)

0   -1.000000
1   -1.000000
2   -1.409836
3   -1.609756
4   -1.725845
5   -1.529101
6   -1.648273
7   -1.492481
8   -1.609720
9   -1.921223
dtype: float64

In [142]:
A = [1,2,3,4]
A[-5:]

[1, 2, 3, 4]

In [134]:
alpha = 0.2
e = s.expanding().apply(
    lambda x: np.multiply(np.array([(1-alpha)**i for i in range(len(x), 0, -1)]), np.array(x)).sum() /
    np.array([(1-alpha)**i for i in range(len(x), 0, -1)]).sum()
)

In [135]:
e.head(10)

0   -1.000000
1   -1.000000
2   -1.409836
3   -1.609756
4   -1.725845
5   -1.529101
6   -1.648273
7   -1.492481
8   -1.609720
9   -1.921223
dtype: float64

In [140]:
n = 3

alpha = 0.2
e = s.expanding().apply(
    lambda x: np.multiply(np.array([(1-alpha)**i for i in range(len(x[-n:]), 0, -1)]), np.array(x[-n:])).sum() / np.array([(1-alpha)**i for i in range(len(x[-n:]), 0, -1)]).sum()
)
e.head(10)

0   -1.000000
1   -1.000000
2   -1.409836
3   -1.737705
4   -2.000000
5   -1.590164
6   -1.672131
7   -1.327869
8   -1.672131
9   -2.147541
dtype: float64

In [145]:
# reduces to ewm when n is dynamically expanding
alpha = 0.2
e = s.expanding().apply(
    lambda x: np.multiply(np.array([(1-alpha)**i for i in range(len(x[-len(x):]), 0, -1)]), np.array(x[-len(x):])).sum() / np.array([(1-alpha)**i for i in range(len(x[-len(x):]), 0, -1)]).sum()
)
e.head(10)

0   -1.000000
1   -1.000000
2   -1.409836
3   -1.609756
4   -1.725845
5   -1.529101
6   -1.648273
7   -1.492481
8   -1.609720
9   -1.921223
dtype: float64